app/controllers/short_urls_controller.rb

SELECT id,full_url,click_count FROM `short_urls` ORDER BY click_count DESC LIMIT 100
---
  def index
    urls = ShortUrl.order('click_count DESC').limit(100);

INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('http://google.com', '2022-05-26 02:56:15.884231', '2022-05-26 02:56:15.884231')
INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('http://google.com', '2022-05-26 05:10:16.554303', '2022-05-26 05:10:16.554303')
---
  def create
    shortUrl = ShortUrl.new(full_url: shortUrl_params)
    if shortUrl.save
      short_code = shortUrl.short_code
      shortUrl.short_code = short_code
      shortUrl.save!

SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`short_code` = 'j' LIMIT 1
UPDATE `short_urls` SET `short_urls`.`click_count` = 2, `short_urls`.`updated_at` = '2022-05-27 05:26:00.042708' WHERE `short_urls`.`id` = 25
---
  def show
    shortUrl = ShortUrl.find_by_short_code(params[:id])
    if shortUrl.nil?
      render json: {"error": "url not found"}, status:404
    else
      shortUrl.update_attribute(:click_count, shortUrl.click_count + 1 )