app/jobs/update_title_job.rb

  def perform(short_url_id)
    shortUrl = ShortUrl.find(short_url_id)
    title = Nokogiri::HTML.parse(open(shortUrl.full_url)).title
    shortUrl.title = title
    shortUrl.save
---
SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`id` = 19 LIMIT 1
UPDATE `short_urls` SET `short_urls`.`title` = 'Google', `short_urls`.`updated_at` = '2022-05-27 03:33:17.124593' WHERE `short_urls`.`id` = 21